<template>
  <SingleColumnTemplate
    sectionClass="about"
    title="О компании"
    :parents="parents"
  >
    <template #section>
      <div
        v-for="(item, idx) in content"
        :key="idx"
        class="about-wrapper container"
      >
        <div class="about-article">
          <img
            :src="require('../assets/image/about/' + item.image + '.svg')"
            :alt="item.image"
          />
        </div>
        <div class="about-article">
          <h3 class="about-article__title">{{ item.title }}</h3>
          <p class="about-article__subtitle " v-html="item.description"></p>
        </div>
      </div>
    </template>
  </SingleColumnTemplate>
</template>
<script>
import SingleColumnTemplate from "@/components/templates/singleColumn";
export default {
  components: { SingleColumnTemplate },
  data: () => ({
    parents: [{ title: "О компании ", link: "/about" }],
    content: [
      {
        title: "",
        description: `  <p>Начав свою деятельность с разработки сайтов, компания с 2009 года расширила компетенцию и спектр предоставляемых услуг прежде всего для корпоративных клиентов (аутсорсинг, аутстаффинг), разработку приложений на технологиях .NET, ASP.NET (C#), разработку хранилищ данных (DWH) на базе Oracle BI, Microstrategy и других систем, администрирование баз данных (DBA), разработку SharePoint приложений, тестирование приложений и сервисов.
  </p>
<p>Заказчики ITWebNet - компании и частные лица разного профиля, стремящиеся оптимизировать свои затраты на разработку
и сопровождение информационных систем, повысить качество
и скорость управления бизнес-процессами за счет новых технологий обработки информации.
</p>

<p>Компанией реализовано более 100 проектов в области разработки хранилищ данных, сайтов, десктоп-приложений, сервисов.</p>`,
        image: "item-1"
      },
      {
        title: "Наша миссия",
        description: `<p>Мы помогаем нашим клиентам быть конкурентными с помощью разработки программного обеспечения, быть доступнее к своим клиентам с помощью разработки сайта, уметь принимать правильные решения с помощью хранилищ данных и систем принятия решений.</p>
<p>
  Мы совершенствуем свою работу, хотим быть лучшими в нашей области за счёт сохранения опыта и использованиясамых передовых технологий. А тем самым, мы совершенствуем наш российский рынок информационных технологий и создаём условия для конкуренции нашей страны во всём мире!
</p>`,
        image: "item-2"
      },
      {
        title: "Наша философия",
        description: `<ul>
  <li>Мы существуем ради наших клиентов, наша качественная
  и эффективная работа на результат есть гарантия нашего
  успеха, продвижения и получения источника дохода.
</li>
  <li>Мы сохраняем опыт и знания, они источник качественной
  и результативной работы для наших клиентов.
</li>
  <li>Мы работаем на имя, оно для нас дороже быстрых денег</li>
  <li>Мы следим за технологиями, изучаем, вбираем в себя знания
  и возвращаем всё это нашим клиентам в виде готовых решений.</li>
  <li>Мы не обещаем нашим клиентам того, что не можем сделать</li>
</ul>`,
        image: "item-3"
      },
      {
        title: "Наши цели",
        description: `<ul>
  <li>Процесс разработки программного обеспечения должен приводить
  к эффективному результату
</li>
  <li>Качественное выполнение поставленных заказчиком задач.
</li>
  <li>Развитие перспективных идей и воплощение их в современное
  программное обеспечение с использованием новейших технологий</li>
  <li>Стать крупным региональным, Российским и мировым разработчиком
  программного обеспечения и IT консалтинга..</li>

</ul>
`,
        image: "item-4"
      },
      {
        title: "Наши задачи",
        description: `<ul>
  <li>Обеспечить качественным сервисом клиентов компании. </li>
  <li>Использовать гибкие (agile) методики разработки, шаблоны
  проектирования в процессах создания программного обеспечения
  и информационных систем.</li>
<li>Разрабатывать и выводить на рынок собственное программное
  обеспечение.</li>
<li>Совершенствовать и обучать коллектив компании.</li>
</ul>`,
        image: "item-5"
      }
    ]
  })
};
</script>
